IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_nmi_intrupt_regs.xml
<module id="NMI_INTRUPT_REGS" HW_revision="" description="NMI INTRUPT Registers">
	<register id="NMICFG" width="16" page="1" offset="0x0" internal="0" description="NMI Configuration Register">
		<bitfield id="NMIE" description="Global NMI Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="NMIFLG" width="16" page="1" offset="0x1" internal="0" description="NMI Flag Register (SYSRsn Clear)">
		<bitfield id="NMIINT" description="NMI Interrupt Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLOCKFAIL" description="Clock Fail Interrupt Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Flash/RAM/ROM Uncorrectable Error NMI Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="REGPARITYERR" description="Register parity error" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="LSCMPERR" description="Lockstep Compare Error" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SWERR" description="SW Error Force NMI Flag" begin="13" end="13" width="1" rwaccess="R"/>
	</register>
	<register id="NMIFLGCLR" width="16" page="1" offset="0x2" internal="0" description="NMI Flag Clear Register">
		<bitfield id="NMIINT" description="NMIINT Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLOCKFAIL" description="CLOCKFAIL Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Flash/RAM/ROM Uncorrectable Error NMI Flag clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="REGPARITYERR" description="Register parity error flag clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LSCMPERR" description="Lockstep Compare Error flag clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SWERR" description="SW Error Flag Clear" begin="13" end="13" width="1" rwaccess="RW"/>
	</register>
	<register id="NMIFLGFRC" width="16" page="1" offset="0x3" internal="0" description="NMI Flag Force Register">
		<bitfield id="CLOCKFAIL" description="CLOCKFAIL Flag Force" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Flash/RAM/ROM Uncorrectable Error NMI Flag force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="REGPARITYERR" description="Register parity error flag force" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LSCMPERR" description="Lockstep Compare Error flag force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SWERR" description="SW Error Flag Force" begin="13" end="13" width="1" rwaccess="RW"/>
	</register>
	<register id="NMIWDCNT" width="16" page="1" offset="0x4" internal="0" description="NMI Watchdog Counter Register">
		<bitfield id="NMIWDCNT" description="NMI Watchdog Counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="NMIWDPRD" width="16" page="1" offset="0x5" internal="0" description="NMI Watchdog Period Register">
		<bitfield id="NMIWDPRD" description="NMI Watchdog Period" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="NMISHDFLG" width="16" page="1" offset="0x6" internal="0" description="NMI Shadow Flag Register">
		<bitfield id="CLOCKFAIL" description="Shadow CLOCKFAIL Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Flash/RAM/ROM Uncorrectable Error NMI shadow flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="REGPARITYERR" description="Register parity error shadow flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="LSCMPERR" description="Lockstep Compare Error shadow flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SWERR" description="Shadow SW Error Flag" begin="13" end="13" width="1" rwaccess="R"/>
	</register>
	<register id="ERRORSTS" width="16" page="1" offset="0x7" internal="0" description="Error pin status">
		<bitfield id="ERROR" description="Error flag." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PINSTS" description="Error pin status." begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="ERRORSTSCLR" width="16" page="1" offset="0x8" internal="0" description="ERRORSTS clear register">
		<bitfield id="ERROR" description="ERRORFLG.ERROR clear bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ERRORSTSFRC" width="16" page="1" offset="0x9" internal="0" description="ERRORSTS force register">
		<bitfield id="ERROR" description="ERRORSTS.ERROR pin force." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ERRORCTL" width="16" page="1" offset="0xa" internal="0" description="Error pin control register">
		<bitfield id="ERRORPOLSEL" description="ERROR pin polarity select" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ERRORLOCK" width="16" page="1" offset="0xb" internal="0" description="Lock register to Error pin registers.">
		<bitfield id="ERRORCTL" description="ERRORCTL Lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
